brew "bandwhich"
brew "bat"
brew "bottom"
brew "eza"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "libusb"
brew "gnupg"
brew "go"
brew "htop"
brew "lazygit"
brew "mas"
brew "ncdu"
brew "neovim"
brew "nmap"
brew "nvm"
brew "openjdk"
brew "python@3.12"
brew "python-tk@3.12"
brew "python@3.13"
brew "ripgrep"
brew "rust"
brew "starship"
brew "thefuck"
brew "tmux"
brew "tree"
brew "wget"
brew "zoxide"
cask "adobe-acrobat-reader"
cask "bitwarden"
cask "brave-browser"
cask "calibre"
cask "discord"
cask "docker-desktop"
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
cask "gimp"
cask "iina"
cask "iterm2"
cask "kap"
cask "maccy"
cask "onyx"
cask "raycast"
cask "rectangle"
cask "sublime-text"
cask "tor-browser"
cask "visual-studio-code"
cask "vlc"
mas "iHosts", id: 1102004240
mas "Keynote", id: 361285480
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
vscode "abusaidm.html-snippets"
vscode "akamud.vscode-theme-onedark"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "coenraads.bracket-pair-colorizer"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "eg2.vscode-npm-script"
vscode "equinusocio.vsc-community-material-theme"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "hookyqr.beautify"
vscode "mgmcdermott.vscode-language-babel"
vscode "mhutchie.git-graph"
vscode "mikael.angular-beastcode"
vscode "ms-ceintl.vscode-language-pack-it"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "msjsdiag.debugger-for-chrome"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "waderyan.gitblame"
vscode "wscats.eno"
vscode "xabikos.javascriptsnippets"
vscode "zhuangtongfa.material-theme"
